//OZA101C JOB ,,NOTIFY=&SYSUID RESTART=STEP1                            00010087
// SET A=SUBPGM                                                         00011099
//STEP2 EXEC IGYWCL,PARM.COBOL='LIB,OBJECT,APOST,DYNAM'                 00020098
//COBOL.SYSIN  DD DSN=OZA101.COBOL.PGMS(&A),DISP=SHR                    00030020
//COBOL.SYSLIB DD DSN=OZA101.COBOL.COPYLIB,DISP=OLD                     00040080
//LKED.SYSLMOD DD DSN=OZA101.COBOL.LOADLIB(&A),DISP=OLD                 00050080
