01 RECORD1.                                                             00010000
   05 DATAPIC X(70).                                                    00020000
01 RECORD2.                                                             00030000
   05 WS-A PIC X(10).                                                   00040000
   05 WS-B PIC X(10).                                                   00050000
   05 WS-C PIC X(10).                                                   00060000
   05 WS-D PIC X(10).                                                   00070000
