       IDENTIFICATION DIVISION.
       PROGRAM-ID. WRITEES.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO AS-DD1
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL
           FILE STATUS IS FS1.
       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 EMPREC.
          02 ENO    PIC X(4).
          02        PIC X(1).
          02 ENAME  PIC A(10).
          02 FILLER PIC X.
          02 DNO    PIC X(3).
          02        PIC X(61).                                          GE SECTI
       WORKING-STORAGE SECTION.
       77 FS1    PIC 99.
       PROCEDURE DIVISION.
       OPEN-PARA.
            DISPLAY "WELCOME TO FILE PROGRAMMING".
            OPEN EXTEND INFILE.
            DISPLAY " OPEN FILE STATUS : " FS1.
       INPUT-PARA.
            ACCEPT ENO.
            ACCEPT ENAME.
            ACCEPT DNO.
       WRITE-PARA.
            WRITE EMPREC.
            DISPLAY "RECORD WRITE STATUS : " FS1.
       CLOSE-PARA.
            CLOSE INFILE.
            STOP RUN.
