       IDENTIFICATION DIVISION.
       PROGRAM-ID. READES.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO AS-DD1
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL
           FILE STATUS IS FS1.
       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 EMPREC.
          02 FS-ID     PIC 99.
          02 FS-NAME   PIC A(10).
          02 FS-LOC    PIC X(3).
          02           PIC X(25).
        WORKING-STORAGE SECTION.
       77 FS1    PIC 99.
       77 WS-ID  PIC 99.
       PROCEDURE DIVISION.
       WRITE-PARA.
            OPEN OUTPUT INFILE
            MOVE 10 TO FS-ID
            MOVE 'RAM' TO FS-NAME
            MOVE 'BLR' TO FS-LOC
            WRITE EMPREC
            DISPLAY "WRITE STS " FS1
            CLOSE INFILE.
       OPEN-PARA.
            OPEN I-O INFILE.
            DISPLAY " OPEN FILE STATUS : " FS1.
       READ-PARA.
            ACCEPT WS-ID
            PERFORM UNTIL FS1 NOT = 0
               READ INFILE
               AT END
                  DISPLAY "END OF FILE REACHED"
               NOT AT END
                  DISPLAY " EMPLOYEE NO   : " FS-ID
                  DISPLAY " EMPLOYEE NAME : " FS-NAME
                  DISPLAY " DEPARTMENT    : " FS-LOC
                  IF FS-ID = WS-ID
                     MOVE 'HYD'   TO FS-LOC
                     REWRITE EMPREC
                     DISPLAY "RECORD REWRITTEN : " EMPREC "FS " FS1
                  END-IF
               END-READ
            END-PERFORM.
       CLOSE-PARA.
            CLOSE INFILE.
            STOP RUN.
