        ID DIVISION.
        PROGRAM-ID. ESDSWRT.
        ENVIRONMENT DIVISION.
        INPUT-OUTPUT SECTION.
        FILE-CONTROL.
             SELECT INFILE ASSIGN TO AS-DD1
             FILE STATUS IS WS-FS.
        DATA DIVISION.
        FILE SECTION.
        FD INFILE.
        01 INREC.
           05 FS-ID       PIC 99.
           05 FS-NAME     PIC X(10).
           05 FS-LOC      PIC X(3).
           05             PIC X(5).

        WORKING-STORAGE SECTION.
        77 WS-FS          PIC 99.

        PROCEDURE DIVISION.
        MAIN-PARA.
               OPEN OUTPUT INFILE
               IF WS-FS = 0
                 MOVE '20VENKATYADVBLR' TO INREC
                 WRITE INREC
                 IF WS-FS = 0
                    DISPLAY "WRITE SUCCESS "
                 ELSE
                    DISPLAY "WRITE FAILED WITH " WS-FS
                 END-IF
               ELSE
                 DISPLAY "OPEN FAILED WITH " WS-FS
               END-IF
               CLOSE INFILE
               STOP RUN.
