       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXTSUB.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RES    PIC 9(4) IS EXTERNAL.
       LINKAGE SECTION.
       77 SNUM1    PIC 9(3).
       77 SNUM2    PIC 9(3).
       PROCEDURE DIVISION USING SNUM1, SNUM2.
       PARA1.
            DISPLAY "WELCOME TO SUB PROGRAM".
            COMPUTE RES = SNUM1 + SNUM2.
            GOBACK.
