ID DIVISION.
PROGRAM-ID. INTRINFN.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 VARS.
   05 C-DATE PIC 9(8).
   05 ALPH   PIC X(10) VALUE "PRIYA".
PROCEDURE DIVISION.
000-MAIN-PARA.
    DISPLAY "CURRENT DATE " FUNCTION CURRENT-DATE(1:8)
    DISPLAY "LOWER CASE   " FUNCTION LOWER-CASE(ALPH)
    DISPLAY "REVERSE      " FUNCTION REVERSE(ALPH)
    STOP RUN.
