       IDENTIFICATION DIVISION.
       PROGRAM-ID. KSEQOPRT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPFILE ASSIGN TO DD1
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS ENO
           FILE STATUS IS FS1.
       DATA DIVISION.
       FILE SECTION.
       FD EMPFILE.
       01 EMPREC.
          02 ENO    PIC X(3).
          02        PIC X(1).
          02 ENAME  PIC A(10).
          02 FILLER PIC X.
          02 DNO    PIC XX.
          02 FILLER PIC X(63).
       WORKING-STORAGE SECTION.
       77 FS1 PIC 99.
       PROCEDURE DIVISION.
       MAIN-PARA.
            ACCEPT ENO.
            ACCEPT ENAME.
            ACCEPT DNO.
            OPEN EXTEND EMPFILE.
            DISPLAY "FILE STATUS " FS1
            PERFORM WRITE-PARA.
            CLOSE EMPFILE
            OPEN I-O EMPFILE
            PERFORM READ-PARA.
            PERFORM REWRITE-PARA
            PERFORM READ-PARA.
            PERFORM DELETE-PARA.
            CLOSE EMPFILE.
            STOP RUN.
         WRITE-PARA.
            WRITE EMPREC.
            IF FS1 = 0
               DISPLAY "WRITE SUCCESS"
            ELSE
               DISPLAY "ERROR" FS1
            END-IF.
         READ-PARA.
            READ EMPFILE NEXT RECORD
              AT END DISPLAY "END OF FILE"
              NOT AT END DISPLAY "RECORD READ " EMPREC
            END-READ.
         REWRITE-PARA.
            ACCEPT ENAME
            ACCEPT DNO
            REWRITE EMPREC
            END-REWRITE.
            DISPLAY "REWRITE STATUS" FS1.
         DELETE-PARA.
            DELETE EMPFILE RECORD
            END-DELETE.
            DISPLAY "DELETE STATUS " FS1.
