ID DIVISION.
PROGRAM-ID. MERGEEG.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
     SELECT INFL1 ASSIGN TO DD1.
     SELECT INFL2 ASSIGN TO DD2.
     SELECT OUTFL ASSIGN TO DD3.
     SELECT MERGFL ASSIGN TO SORTWK01.
DATA DIVISION.
FILE SECTION.
FD INFL1.
01 IN1-REC PIC X(80).
FD OUTFL.
01 OUT-REC PIC X(80).
FD INFL2.
01 IN2-REC PIC X(80).
SD MERGFL.
01 MERG-REC.
    05 MERG-FLD PIC X(3).
    05 FILLER   PIC X(77).
PROCEDURE DIVISION.
000-MAIN-PARA.
    MERGE MERGFL
      ON ASCENDING KEY MERG-FLD
      USING INFL1, INFL2
      GIVING OUTFL.
    stop run.
