       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARRAY1D.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ARRWEEK .
          02 ADAY PIC A(3) OCCURS 7 TIMES VALUE "ABC".
       77 I       PIC 9(2).
       PROCEDURE DIVISION.
       MAIN-PARA.
            DISPLAY " DAYS OF THE WEEK...".
            PERFORM TABLE-PARA VARYING I FROM 1 BY 1 UNTIL I > 7.
            STOP RUN.
       TABLE-PARA.
            DISPLAY " DAY " I " IS " ADAY(I).
