       IDENTIFICATION DIVISION.
       PROGRAM-ID. REDFN.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 EMP-DETAILS.
          02 ENUM     PIC X(4) VALUE "E001".
          02 ENAME    PIC A(15) VALUE "JIMMY".
          02 STREET   PIC X(10) VALUE "DOMLUR ".
          02 CITY     PIC X(15) VALUE "BANGALORE ".
          02 STATE    PIC X(10) VALUE "KARNATAKA".
          02 DOJ      PIC 9(8) VALUE 20082013.
       66 EMP-ADDR  RENAMES STREET THRU STATE.
       77 EDIT-DOJ    PIC 99/99/9999.
       77 JYEAR       PIC 9(4).
       PROCEDURE DIVISION.
       OUTPUT-PARA.
            DISPLAY "NAME IS " ENAME.
            DISPLAY "ADDRESS IS " EMP-ADDR.
      *     MOVE DOJ TO EDIT-DOJ.
      *     DISPLAY "DOJ IS " EDIT-DOJ.
      *     MOVE DOJ(5:4) TO JYEAR.
      *     DISPLAY "EMPLOYEE HAS JOINED IN " JYEAR.
            STOP RUN.
