//FSS087EX JOB ,,NOTIFY=&SYSUID
//JOBLIB DD DSN=FSS087.COBOL1.LOADLIB,DISP=SHR
//STEP1 EXEC PGM=MAINPGMD
//DD1 DD DSN=FSS087.COBOL.MERGEIN1,DISP=SHR
//DD2 DD DSN=FSS087.COBOL.MERGEIN2,DISP=SHR
//DD3 DD DSN=FSS087.COBOL.MERGEOUT,DISP=SHR
//SORTWK01 DD DSN=&&TEMP
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
