       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARRSRCH.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ARRWEEK VALUE 'SUNMONTUEWEDTHUFRISAT'.
          02 WK-DAY PIC x(3) OCCURS 7 TIMES INDEXED BY INDX.
       77 SDAY    PIC A(3).
       77 I       PIC 9.
       PROCEDURE DIVISION.
       MAIN-PARA.
            DISPLAY " SEARCH ARRAY - DEMO".
            ACCEPT SDAY.
            DISPLAY " ELEMENT TO BE SEARCHED IS " SDAY.
       SEARCH-PARA.
            SEARCH WK-DAY AT END DISPLAY "ELEMENT NOT FOUND"
                 WHEN WK-DAY(INDX) = SDAY
                   DISPLAY " ELEMENT FOUND SUCCESSFULLY"
                   SET I TO INDX
                   DISPLAY " DAY " I " IS " WK-DAY(INDX)
            END-SEARCH.
            STOP RUN.
